INSERT INTO users ("first_name", "last_name", "city", "birth_date", "gender", "email", "password")
SELECT 
    first_name,
    last_name,
    city,
    birth_date,
    gender,
    lower(first_name || '.' || last_name || substring(md5(random()::text) from 1 for 6) || '@example.com') AS email,
    '$2b$05$hRv7EEsdwmw3BIFXPlPQzusuSLankMPDSEetjCplyKRJNHZcV1nV6' AS password -- пароль password для всех пользоавтелей
FROM (
    SELECT
        (ARRAY[
'Александр','Максим','Иван','Дмитрий','Никита','Михаил','Андрей','Артём','Кирилл','Егор',
'Николай','Владимир','Алексей','Олег','Сергей','Роман','Тимофей','Илья','Антон','Павел',
'Вячеслав','Виктор','Станислав','Георгий','Ярослав','Константин','Арсений','Фёдор','Вадим','Игорь',
'Даниил','Василий','Леонид','Родион','Семен','Валентин','Виталий','Анатолий','Григорий','Богдан',
'Эдуард','Артур','Юрий','Пётр','Адам','Тимур','Альберт','Лев','Давид','Назар',
'Рустам','Глеб','Ян','Савелий','Дамир','Марат','Владислав','Станимир','Трофим','Валерий',
'Иосиф','Аркадий','Радомир','Всеволод','Бронислав','Захар','Вениамин','Геннадий','Ефим','Игнат',
'Лука','Мирон','Роман','Прохор','Тихон','Яким','Сергей','Елисей','Нестор','Арсений',
'Филипп','Савва','Тарас','Эльдар','Влас','Демьян','Леон','Марк','Оскар','Роберт',
'Герасим','Алекс','Тимофей','Семен','Александр','Матвей','Давид','Денис','Ян','Игнатий'
]
)[floor(random() * 100 + 1)] AS first_name,
        (ARRAY[
'Иванов','Петров','Сидоров','Фёдоров','Орлов','Смирнов','Кузнецов','Попов','Васильев','Новиков',
'Морозов','Егоров','Соловьёв','Волков','Зайцев','Беляев','Тарасов','Куликов','Макаров','Григорьев',
'Андреев','Николаев','Козлов','Семёнов','Соколов','Лебедев','Кравцов','Кузьмин','Баранов','Александров',
'Данилов','Медведев','Фролов','Игнатов','Гусев','Тихонов','Жуков','Романов','Михайлов','Акимов',
'Павлов','Воробьёв','Коновалов','Гаврилов','Лазарев','Никифоров','Дорофеев','Филиппов','Елисеев','Максимов',
'Дмитриев','Прохоров','Власов','Рябов','Ширяев','Александров','Нестеров','Кудряшов','Горбунов','Панков',
'Богданов','Ермаков','Капустин','Савельев','Титов','Дьяков','Мартынов','Сафонов','Горшков','Поляков',
'Агеев','Родионов','Зуев','Белов','Фокин','Шестаков','Горшков','Калинин','Лукин','Анисимов',
'Пименов','Суханов','Тарасов','Малинин','Пахомов','Левин','Капитонов','Яковлев','Астафьев','Богомолов',
'Васильев','Воронцов','Кочетов','Савин','Сергеев','Фомин','Князев','Игнатьев','Ефимов','Потапов'
]
)[floor(random() * 100 + 1)] AS last_name,

        (ARRAY[
            'Москва','Санкт-Петербург','Калининград','Севастополь','Казань',
            'Екатеринбург','Новосибирск','Самара','Омск','Челябинск','Ростов-на-Дону',
            'Уфа','Красноярск','Воронеж','Пермь','Волгоград','Саратов',
            'Тюмень','Иркутск','Барнаул'
        ])[floor(random() * 20 + 1)] AS city,

        date '1950-01-01' + (trunc(random() * 24000)::int) * interval '1 day' AS birth_date,

        (ARRAY['male', 'female'])[floor(random() * 2 + 1)] AS gender
    FROM generate_series(1, 1000000)
) AS t;


